Repository: wkddnjset/K-Global-Starthon
Catalog: Project/Watson API/tmx/deep_learning.tmx
Source language: en
Languages: ko

source: This paper is a study to improve the classification efficiency of rotating objects by using deep neural networks to which a deep learning algorithm was applied.
ko: 제안 방법의 성능을 평가하기 위해 테스트셋을 구축하여 단일세션검증, 시간차 검증, 위조서명 검증의 3가지 실험을 실시하였다.

source: For the classification experiment of rotating objects, COIL-20 is used as data and total 3 types of classifiers are compared and analyzed.
ko: 실험결과 위조서명 구분에 있어서 제안방법은 기존 방법보다 EER이 최대 6.9% 더 낮았다.

source: 3 types of classifiers used in the study include PCA classifier to derive a feature value while reducing the dimension of data by using Principal Component Analysis and classify by using euclidean distance, MLP classifier of the way of reducing the error energy by using error back-propagation algorithm and finally, deep learning applied DBN classifier of the way of increasing the probability of observing learning data through pre-training and reducing the error energy through fine-tuning.
ko: 또한, 서명의 모양과 속도만 사용한 기존의 방식보다 가속도센서를 추가한 방식이 1.5% 나은 성능을 보였고, 최고 3.5%의 에러율을 얻었다.

source: In order to identify the structure-specific error rate of the deep neural networks, the experiment is carried out while changing the number of hidden layers and number of hidden neurons.
ko: 본 논문에서는 딥뉴럴네트워크에 기반한 디지털 통신 신호의 자동변조분류 기법을 제안하였다.

source: The classifier using DBN showed the lowest error rate.
ko: 제안하는 기법은 수신 신호 샘플로부터 19가지의 특징값을 계산하여 4개의 층을 가진 딥뉴럴네트워크의 입력 데이터로 사용하여 신호를 분류하는 방법이다.

source: Its structure of deep neural networks with 2 hidden layers showed a high recognition rate by moving parameters to a location helpful for recognition.
ko: 19가지의 특징값에는 기존에 사용된 특징값과 고차 통계값 등의 다양한 특징값을 추가하였다.

source: While the Internet develops rapidly, a huge amount of image data collected from smart phones, digital cameras and black boxes are being shared through social media sites.
ko: 컴퓨터 시뮬레이터를 이용하여 BPSK, QPSK, 8-PSK, 16-QAM, 64-QAM의 5개의 변조 방식을 구분하기 위한 훈련데이터를 생성하여 다양한 신호대잡음비, 페이딩 환경에 대해 딥뉴럴네트워크를 훈련하였다.

source: Generally, social images are handled by tagging them with information.
ko: 실험 결과에서 AWGN 환경 및 Rician 페이딩환경에서 모두 제안한 딥뉴럴네트워크 기반의 변조분류 기법이 기존의 기법에 비해 좋은 성능을 나타냄을 확인 하였다.

source: Due to the ease of sharing multimedia and the explosive increase in the amount of tag information, it may be considered too much hassle by some users to put the tags on images.
ko: 최근 빅데이터와 오버피팅 방지 하드웨어 성능향상으로 딥러닝(deep learning) 이 떠오르고 있다.

source: Image retrieval is likely to be less accurate when tags are absent or mislabeled.
ko: 그 중에 CNN(Convolutional Neural Networks)은 이동 크기 회전에 내성을 갖기 때문에 로봇환경에서의 얼굴인식에 적합하다.

source: In this paper, we suggest a method of extracting tags from social images by using image content.
ko: 본 논문은 3차원 CNN을 이용하여 비디오 기반 얼굴인식을 수행하였으며 데이터 베이스를 가지고 실험을 하였다 데이터 50장을 학습하여1m 50장 2m 200장 3m 100장을 검증한 결과로 특징 맵 수에 따라 최고 100%, 88%, 73% 인식률을 얻었다.

source: In this method, CNN(Convolutional Neural Network) is trained using ImageNet images with labels in the training set, and it extracts labels from instagram images.
ko: 본 논문은 딥러닝 알고리즘을 적용한 깊은신경망을 이용하여 회전 객체의 분류 효율성을 높이기 위한 연구이다.

source: We use the extracted labels for automatic image tagging.
ko: 회전객체의 분류 실험을 위하여 데이터는 COIL-20을 사용하며 객체의 2/3영역을 학습시키고 1/3영역을 유추하여 분류한다.

source: The experimental results show that the accuracy is higher than that of instagram retrievals.
ko: 연구에 이용된 3가지 분류기는 주성분 분석법을 이용해 데이터의 차원을 축소하면서 특징값을 추출하고 유클리디안 거리를 이용하여 분류하는 PCA분류기와 오류역전파 알고리즘을 이용하여 오류 에너지를 줄여가는 방식의 MLP분류기, 마지막으로 pre-training을 통하여 학습데이터의 관찰될 확률을 높여주고 fine-tuning으로 오류에너지를 줄여가는 방식의 딥러닝을 적용한 DBN분류기이다.

source: In this paper, we proposed an image analysis bot system with a method of pedestrian detection based on deep learning algorithm.
ko: 깊은신경망의 구조별 오류율을 확인하기 위하여 은닉층의 개수와 은닉뉴런의 개수를 변경해가며 실험하고 실제로 가장 낮은 오류율을 나타내는 구조를 기술한다.

source: First, the convolutional neural network, the algorithm most widely used for image analysis technology, was applied to object classifier generation technique.
ko: 가장 낮은 오류율을 보였던 분류기는 DBN을 이용한 분류기이다.

source: Second, we used it to implement an image analysis bot system.
ko: 은닉층을 2개 갖는 깊은신경망의 구조로 매개 변수들을 인식에 도움이 되는 곳으로 이동 시켜 높은 인식률을 보여줬다.

source: We designed some base solutions such as intrusion detection solution, access detection solution and behavior detection solution for image analysis system.
ko: 인터넷이 급속히 발달하는 가운데 스마트폰, 디지털 카메라, 블랙박스 등의 기기에서 수집되는 방대한 영상 데이터가 소셜 미디어 사이트를 통해 빠르게 공유되고 있다.

source: In the experiments, we compared our method with SIFT and HOG.
ko: 소셜 미디어 공유 사이트에서는 일반적으로 이미지의 태그 정보를 사용하는데, 멀티미디어를 공유하는 방법이 쉬워지고 그 양이 폭발적으로 증가함에 따라 이미지에 태그를 붙여야 하는 일은 번거로움이 되고 있다.

source: Through the experimental results, we proved that our method takes advantage of the accuracy.
ko: 또한 태그가 잘못 붙여지거나 안 붙은 경우에는 이미지 검색 정확도가 떨어질 가능성이 있다.

source: The recurrent neural network (RNN) is a deep learning model which is suitable to sequential or length-variable data.
ko: 본 논문에서는 이미지의 내용정보를 이용하여 자동으로 이미지로부터 태그를 추출하는 방법을 제안한다.

source: The Long Short-Term Memory (LSTM) mitigates the vanishing gradient problem of RNNs so that LSTM can maintain the long-term dependency among the constituents of the given input sequence.
ko: 제안하는 방법은 ImageNet에서 제공하는 대용량의 이미지 데이터와 라벨을 CNN(Convolutional Neural Network) 딥러닝 기법으로 학습시킨후, 인스타그램 이미지로부터 라벨 정보를 추출하는 것이다.

source: In this paper, we propose a LSTM based language model which can predict following words of a given incomplete sentence to generate a complete sentence.
ko: 추출된 라벨 정보를 이용하여 자동 태깅한 후, 검색에 활용했을 때 인스타그램의 기존 검색보다 높은 정확도를 가지고 있음을 알 수 있었다.

source: To evaluate our method, we trained our model using multiple Korean corpora then generated the incomplete part of Korean sentences.
ko: 본 논문에서는 딥러닝 알고리즘을 기반으로 하는 보행자 검출 방법을 적용한 방범용 영상분석 봇 시스템을 제안한다.

source: The result shows that our language model was able to generate the fluent Korean sentences.
ko: 영상분석 기술로 가장 많이 사용되고 있는 컨볼루션 신경망 모델을 이용하여 객체 분류기 생성 기술을 제안하고, 이를 기반으로 영상분석 봇 시스템을 구현하였다.

source: We also show that the word based model generated better sentences compared to the other settings.
ko: 그리고 영상 감시 시스템을 위한 침입자 검출 솔루션, 출입자 감시 솔루션, 이상행위 감지 솔루션 등 기반 솔루션을 설계하여 실험을 진행하였다.

source: Nowadays, computer science has recently been introduced and used deep learning algorithms in the field of pattern recognition.
ko: 제안하는 방법과 기존의 특징 추출 방법인 SIFT, HOG 등과의 비교 실험을 통해 제안하는 방법이 정확도 측면에서 우수한 결과를 얻을 수 있음을 증명하였다.

source: However, those deep learning algorithm has not been utilized in the field of connectionist modeling of language process which has used pattern recognization algorithms for computational perspective yet.
ko: 순환신경망은 순차적이거나 길이가 가변적인 데이터에 적합한 딥러닝 모델이다.

source: In this study, we made a modeling which use the deep belief network which is a type of deep learning algorithm, and train the relation between words and semantic.
ko: LSTM은 순환신경망에서 나타나는 기울기 소멸문제를 해결함으로써 시퀀스 구성 요소간의 장기의존성을 유지 할 수 있다.

source: After training, the model conducted the lexical decision task for model, and the results were statistically verified that it is similar with result of behavioral experiment with frequency effect as center.
ko: 본 논문에서는 LSTM에 기반한 언어모델을 구성하여, 불완전한 한국어 문장이 입력으로 주어졌을 때 뒤 이어 나올 단어들을 예측하여 완전한 문장을 생성할 수 있는 방법을 제안한다.

source: As the results of this study, the model showed that model was able to conduct language process through drawing the frequency effect.
ko: 제안된 방법을 평가하기 위해 여러 한국어 말뭉치를 이용하여 모델을 학습한 다음, 한국어 문장의 불완전한 부분을 생성하는 실험을 진행하였다.

source: This result suggested that the model which used deep learning algorithm is able to be used as connectionist modeling, and to simulate the language process of human.
ko: 실험 결과, 제시된 언어모델이 자연스러운 한국어 문장을 생성해 낼 수 있음을 확인하였다.

source: In addition, in this study, we discussed how deep belief network can be applied to the connectionist modeling.
ko: 또한 문장 최소 단위를 어절로 설정한 모델이 다른 모델보다 문장 생성에서 더 우수한 결과를 보임을 밝혔다.

source: Social-aware video displays not only the relationships between characters but also diverse information on topics such as economics, politics and culture as a story unfolds.
ko: 영역기반 영상정합은 미리 정의된 특징의 도움 없이 영상을 정합할 수 있기 때문에, 기계학습과 접목된다면 이론 상 다양한 영상정합 문제에 적용 가능하다.

source: Particularly, the speaking habits and behavioral patterns of people in different situations are very important for the analysis of social relationships.
ko: 그러나 신속한 정합을 위하여, 미리 정의된 특징을 탐지하여 패치 쌍 후보를 선정에 사용하는데, 이는 영역기반 방법의 적용성에 제약을 준다.

source: However, when dealing with this dynamic multi-modal data, it is difficult for a computer to analyze the drama data effectively.
ko: 이를 해소하기 위하여 본 연구에서는 단순히 두 패치의 관련도 뿐만 아니라 두 패치가 어느 정도 공간 상 떨어져 있는지에 대한 정보를 제공하는 ConvNet Dart를 개발하였다.

source: To solve this problem, previous studies employed the deep concept hierarchy (DCH) model to automatically construct and analyze social networks in a TV drama.
ko: 이러한 정보를 기반으로 효율적으로 패치 쌍 탐색공간을 줄일 수 있었다.

source: Nevertheless, since location knowledge was not included, they can only analyze the social network as a whole in stories.
ko: 추가로 Dart가 제대로 작동할 수 없는 영역을 식별하는 ConvNet Fad를 개발하여 정합의 정밀도를 높였다.

source: In this research, we include location knowledge and analyze the social relations in different locations.
ko: 본 연구에서는 이들을 딥러닝으로 학습하였으며, 이를 위해 소수의 정합된 영상에서 다량의 예제를 생성하는 방법을 개발하였다.

source: We adopt data from approximately 4400 minutes of a TV drama Friends as our dataset.
ko: 마지막으로 단순한 영상정합 문제에 성공적으로 적용하여, 이러한 방법론이 작동하는 것을 보였다.

source: We process face recognition on the characters by using a convolutional- recursive neural networks model and utilize a bag of features model to classify scenes.
ko: 최근 컴퓨터 공학의 패턴인식 분야에서는 딥러닝 알고리즘이 도입 및 활용되고 있다.

source: Then, in different scenes, we establish the social network between the characters by using a deep concept hierarchy model and analyze the change in the social network while the stories unfold.
ko: 하지만, 언어 처리에 관한 계산주의적 접근을 위해 패턴인식 알고리즘들을 적용해 왔던 연결주의 모델링 분야에서는 아직까지 딥러닝 알고리즘이 제대로 활용되지 못하고 있다.

source: Syntactic information represents the dependency relation between predicates and arguments, and it is helpful for improving the performance of Semantic Role Labeling systems.
ko: 본 연구에서는 딥러닝 알고리즘 중 하나인 deep belief network 알고리즘을 이용한 모델링을 구축하고, 단어와 의미 간의 관계를 학습시켰다.

source: However, syntax analysis can cause computational overhead and inherit incorrect syntactic information.
ko: 학습 과정 이후 모델용의 어휘 판단 과제를 수행하여, 빈도 효과(frequency effect)를 중심으로 행동 실험과 유사한 결과가 도출되는지 통계적으로 검증하였다.

source: To solve this problem, we exclude syntactic information and use only morpheme information to construct Semantic Role Labeling systems.
ko: 모델링 수행 결과, 모델은 행동실험과 유사하게 빈도 효과를 도출해냄으로써, 모델이 정상적인 언어 처리가 가능함을 보였다.

source: In this study, we propose an end-to-end SRL system that only uses morpheme information with Stacked Bidirectional LSTM-CRFs model by extending the LSTM RNN that is suitable for sequence labeling problem.
ko: 본 연구의 결과는, 딥러닝 알고리즘으로 구축된 모델이 연결주의 모델링, 더 나아가 실제 사람의 언어 처리를 모사해 낼 수 있음을 제시한다.

source: Our experimental results show that our proposed model has better performance, as compare to other models.
ko: 아울러서 본 연구에서는, 어떻게 deep belief network 알고리즘이 연결주의 모델링에 적용이 가능한가에 대해서도 논의하였다.

source: Recently, deep learning is used for intelligent processing and accuracy improvement of data.
ko: Social-aware video는 자유로운 스토리 전개를 통해 인물들간의 관계뿐만 아니라 경제, 정치, 문화 등 다양한 지식을 사람에게 전달해주고 있다.

source: It is formed calculation model composed of multi data processing layer that train the data representation through an abstraction of the various levels.
ko: 특히 장소에 따른 사람들간의 대화 습성과 행동 패턴은 사회관계를 분석하는데 있어서 아주 중요한 정보이다.

source: A category of deep learning, convolution neural network is utilized in various research fields, which are human pose estimation, face recognition, image classification, speech recognition.
ko: 하지만 멀티모달과 동적인 특성으로 인해 컴퓨터가 비디오로부터 자동으로 지식을 습득하기에는 아직 많은 어려움이 있다.

source: When using the deep layer and lots of class, CNN that show a good performance on image classification obtain higher classification rate but occur the overfitting problem, when using a few data.
ko: 이러한 문제점들을 해결하기 위해 기존의 연구에서는 딥하이퍼넷 모델을 사용하여 드라마 등장인물의 시각과 언어 정보를 기반으로 계층적 구조를 사용해 소셜 네트워크를 분석하였다.

source: So, we design the training network based on convolution neural network and trained our image data set for object classification in few class problem.
ko: 하지만 장소 정보를 사용하지 않아 전반적인 스토리로부터 소셜 네트워크를 분석할 수밖에 없었다.

source: The experiment show the higher classification rate of 7.06% in average than the previous networks designed to classify the object in 1000 class problem.
ko: 본 논문에서는 기존 연구를 바탕으로 장소 정보를 추가하여 각 장소에서의 인물 특성을 분석해 보았다.

source: In this paper, we propose facial expression recognition using CNN (Convolutional Neural Network), one of the deep learning technologies.
ko: 본 논문에서는 총 4400분 분량의 TV드라마 “Friends”를 사용했고 C-RNN모델을 통해 등장인물을 인식하였으며 Bag of Features로 장소를 분류하였다.

source: To overcome the disadvantages of existing facial expression databases, various databases are used.
ko: 그리고 딥하이퍼넷 모델을 통해 자동으로 소셜 네트워크를 생성하였고 각 장소에서의 인물 관계 변화를 분석하였다.

source: In the proposed technique, we construct six facial expression data sets such as "expressionless", "happiness", "sadness", "angry", "surprise", and "disgust".
ko: 의미역 결정 연구에 있어 구문 분석 정보는 술어-논항 사이의 의존 관계를 포함하고 있기 때문에 의미역 결정 성능 향상에 큰 도움이 된다.

source: Pre-processing and data augmentation techniques are also applied to improve efficient learning and classification performance.
ko: 그러나 의미역 결정 이전에 구문 분석을 수행해야 하는 비용(overhead)이 발생하게 되고, 구문 분석 단계에서 발생하는 오류를 그대로 답습하는 단점이 있다.

source: In the existing CNN structure, the optimal CNN structure that best expresses the features of six facial expressions is found by adjusting the number of feature maps of the convolutional layer and the number of fully-connected layer nodes.
ko: 이러한 문제점을 해결하기 위해 본 논문에서는 구문 분석 정보를 제외한 형태소 분석 정보만을 사용하는 End-to-end SRL 방식의 한국어 의미역 결정 시스템을 제안하고, 순차 데이터 모델링에 적합한 LSTM RNN을 확장한 Stacked Bidirectional LSTM-CRFs 모델을 적용해 구문 분석 정보 없이 기존 연구보다 더 높은 성능을 얻을 수 있음을 보인다.

source: Experimental results show that the proposed scheme achieves the highest classification performance of 96.88% while it takes the least time to pass through the CNN structure compared to other models.
ko: 최근 데이터의 지능적 처리 및 정확도 향상을 위해 딥러닝 기술이 응용되고 있다.

source: Recently, Internet of Things (IoT) and deep learning techniques have affected video surveillance systems in various ways.
ko: 이 기술은 다층의 데이터 처리레이어들로 구성된 계산 모델을 통해 이루어지는데, 이 모델은 여러 수준의 추상화를 거쳐 데이터의 표현을 학습한다.

source: The surveillance features that perform detection, tracking, and classification of specific objects in Closed Circuit Television (CCTV) video are becoming more intelligent.
ko: 딥러닝의 한 부류인 컨볼루션 신경망은 인간 행동 추정, 얼굴 인식, 이미지 분류, 음성 인식 같은 연구 분야에서 많이 활용되고 있다.

source: This paper presents real-time algorithm that can run in a PC environment using only a low power CPU.
ko: 이미지 분류에 좋은 성능을 보여주는 컨볼루션 신경망은 깊은 학습망과 많은 부류를 이용하면 효과적으로 분류율을 높일수 있지만, 적은 부류의 데이터를 사용할 경우, 과적합 문제가 발생할 확률이 높아진다.

source: Traditional tracking algorithms combine background modeling using the Gaussian Mixture Model (GMM), Hungarian algorithm, and a Kalman filter; they have relatively low complexity but high detection errors.
ko: 따라서 본 논문에서는 컨볼루션 신경망기반의 소부류의 분류을 위한 학습망을 제작하여 자체적으로 구축한 이미지 DB를 학습시키고, 객체를 분류하는 연구를 실험 하였으며, 1000개의 부류를 분류하기 위해 제작된 기존 공개된 망들과 비교 실험을 통해 기존 망보다 평균 7.06%이상의 상승된 분류율을 보여주었다.

source: To supplement this, deep learning technology was used, which can be trained from a large amounts of data.
ko: 본 논문에서는 딥러닝 기술 중의 하나인 CNN(Convolutional Neural Network)을 이용한 얼굴 표정 인식 기법을 제안한다.

source: In particular, an SRGB(Sequential RGB)-3 Layer CNN was used on tracked objects to emphasize the features of moving people.
ko: 기존의 얼굴 표정 데이터베이스의 단점을 보완하고자 질 좋은 다양한 데이터베이스를 이용한다.

source: Performance evaluation comparing the proposed algorithm with existing ones using HOG and SVM showed move-in and move-out error rate reductions by 7.6 % and 9.0 %, respectively.
ko: 제안한 기법에서는 ‘무표정’, ‘행복’, ‘슬픔’, ‘화남’, ‘놀람’, 그리고 ‘역겨움’ 등의 여섯 가지 얼굴 표정 data-set을 구축한다.

source: We analyze the online Hangul handwriting recognition problem (HHR) and present solutions based on recurrent neural networks.
ko: 효율적인 학습 및 분류 성능을 향상시키기 위해서 전 처리 및 데이터 증대 기법(data augmentation)도 적용한다.

source: The solutions are organized according to the three kinds of sequence labeling problem - sequence classifications, segment classification, and temporal classification, with additional consideration of the structural constitution of Hangul characters.
ko: 기존의 CNN 구조에서 convolutional layer의 특징지도의 수와 fullyconnected layer의 node의 수를 조정하면서 여섯 가지 얼굴 표정의 특징을 가장 잘 표현하는 최적의 CNN 구조를 찾는다.

source: We present a stacked gated recurrent unit (GRU) based model as the natural HHR solution in the sequence classification level.
ko: 실험 결과 제안하는 구조가 다른 모델에 비해 CNN 구조를 통과하는 시간이 가장 적게 걸리면서도 96.88%의 가장 높은 분류 성능을 보이는 것을 확인하였다.

source: The proposed model shows 86.2% accuracy for recognizing 2350 Hangul characters and 98.2% accuracy for recognizing the six types of Hangul characters.
ko: 최근 IoT 및 딥러닝 관련 기술요소들이 영상보안감시시스템에서도 다양하게 응용되고 있다.

source: We show that the type recognizing model successfully follows the type change as strokes are sequentially written.
ko: 그 중 CCTV를 통해 촬영된 동영상에서 자동으로 특정 객체를 검출, 추적, 분류 하는 감시 기능이 점점 지능화되고 있다.

source: These results show the potential for RNN models to learn high-level structural information from sequential data.
ko: 본 논문에서는 보급형 CPU만 사용하는 PC 환경에서도 실시간 처리가 가능한 알고리즘을 목표로 하였다.

source: In this paper, we analyze the performance of the recently introduced Hint-knowledge distillation (KD) training approach based on the teacher-student framework for knowledge distillation and knowledge transfer.
ko: GMM(Gaussian Mixture Model)을 이용한 배경 모델링과 헝가리안 알고리즘, 그리고 칼만 필터를 조합한 추적 알고리즘은 전통적이며 복잡도가 비교적 적지만 검출 오류가 높다.

source: As a deep neural network (DNN) considered in this paper, the deep residual network (ResNet), which is currently regarded as the latest DNN, is used for the teacher-student framework.
ko: 이를 보강하기 위해 대용량 데이터 학습에 적합한 딥러닝을 기술을 적용하였다.

source: Therefore, when implementing the Hint-KD training, we investigate the impact on the weight of KD information based on the soften factor in terms of classification accuracy using the widely used open deep learning frameworks, Caffe.
ko: 특히 움직임이 있는 사람의 특징을 강조하기 위해 추적된 객체에 대해 SRGB-3 Layer CNN을 사용하였다.

source: As a results, it can be seen that the recognition accuracy of the student model is improved when the fixed value of the KD information is maintained rather than the gradual decrease of the KD information during training.
ko: 성능 평가를 위해 기존의 HOG와 SVM을 이용한 시스템과 비교했을 때 Move-in은 7.6%, Move-out은 9.0%의 오류율 감소가 있었다.

source: As artificial intelligence technology emerges as a core technology of the future, intensive investment, research and development are being carried out by leading global nations and global intellectual property leaders.
ko: 온라인 방식의 한글 필기체 인식 문제를 분석하고 순환신경망 기반의 해법을 모색한다.

source: It is expected that artificial intelligence technology will generate direct and indirect effects in the whole country such as public, industry, and life, and it will be an important part in ensuring global competitiveness and patent strategy of countries and companies in the future.
ko: 한글 낱글자 인식 문제를 순서데이터 레이블링의 관점에서 서열 분류, 구간 분류, 시간별 분류의 세 단계로 구분하여 각각에 대한 해법을 살펴보며, 한글의 구성 원리를 고려한 해결 방안을 정리한다.

source: In this paper, we will examine the research directions of industry, academia, and research to develop international competitiveness through patent trends in artificial intelligence technology.
ko: 한글 2350글자에 대한 온라인 필기체 데이터에 GRU(gated recurrent unit)의 다층 구조를 가지는 서열 분류모델을 적용한 결과, 낱글자 인식 정확도는 86.2%, 초･중･종성 구성에 따른 6가지 유형 분류 정확도는 98.2%로 측정되었다.

source: The emergence of online media and their data has enabled data-driven methods to solve challenging and complex tasks such as rumor classification problems.
ko: 유형 분류 모델로 획의 진행에 따른 유형 변화 역시 높은 정확도로 인식하는 결과를 통해, 순환신경망을 이용하여 순서 데이터에서 한글의 구조와 같은 고차원적 지식을 학습할 수 있음을 확인하였다.

source: Recently, deep learning based models have been shown as one of the fastest and the most accurate algorithms to solve such problems.
ko: 문서 분류 문제는 오랜 기간 동안 자연어 처리 분야에서 연구되어 왔다.

source: These new models, however, either rely on complete data or several days-worth of data, limiting their applicability in real time.
ko: 우리는 기존 컨볼루션 신경망을 이용했던 연구에서 나아가, 순환 신경망에 기반을 둔 문서 분류를 수행하였고 그 결과를 종합하여 제시하려 한다.

source: In this study, we go beyond this limit and test the possibility of super early rumor detection via recurrent neural networks (RNNs).
ko: 컨볼루션 신경망은 단층 컨볼루션 신경망을 사용했으며, 순환 신경망은 가장 성능이 좋다고 알려져 있는 장기-단기 기억 신경망과 회로형 순환 유닛을 활용하였다.

source: Our model takes in social media streams as time series input, along with basic meta-information about the rumongers including the follower count and the psycholinguistic traits of rumor content itself.
ko: 실험 결과, 분류 정확도는 Multinomial Naïve Bayesian Classifier < SVM < LSTM < CNN < GRU의 순서로 나타났다.

source: Based on analyzing millions of social media posts on 498 real rumors and 494 non-rumor events, our RNN-based model detected rumors with only 30 initial posts (i.e., within a few hours of rumor circulation) with remarkable F1 score of 0.74.
ko: 따라서 텍스트 문서 분류 문제는 시퀀스를 고려하는 것 보다는 문서의 feature를 추출하여 분류하는 문제에 가깝다는 것을 확인할 수 있었다.

source: This finding widens the scope of new possibilities for building a fast and efficient rumor detection system.
ko: 그리고 GRU가 LSTM보다 문서의 feature 추출에 더 적합하다는 것을 알 수 있었으며 적절한 feature와 시퀀스 정보를 함께 활용할 때 가장 성능이 잘 나온다는 것을 확인할 수 있었다.

source: In recent years, personal videos have seen a tremendous growth due to the substantial increase in the use of smart devices and networking services in which users create and share video content easily without many restrictions.
ko: 본 논문에서는 지식추출(knowledge distillation) 및 지식전달(knowledge transfer)을 위하여 최근에 소개된 선생-학생 프레임워크 기반의 힌트(Hint)-knowledge distillation(KD) 학습기법에 대한 성능을 분석한다.

source: However, taking both into account would significantly improve event detection performance because videos generally have multiple modalities and the frame data in video varies at different time points.
ko: 본 논문에서 고려하는 선생-학생 프레임워크는 현재 최신 딥러닝 모델로 각광받고 있는 딥 residual 네트워크를 이용한다.

source: This paper proposes an event detection method.
ko: 따라서, 전 세계적으로 널리 사용되고 있는 오픈 딥러닝 프레임워크인 Caffe를 이용하여 학생모델의 인식 정확도 관점에서 힌트-KD 학습 시 선생모델의 완화상수 기반의 KD 정보 비중에 대한 영향을 살펴본다.

source: In this method, high-level features are first extracted from multiple modalities in the videos, and the features are rearranged according to time sequence.
ko: 본 논문의 연구결과에 따르면 KD 정보 비중을 단조감소하는 경우보다 초기에 설정된 고정된 값으로 유지하는 것이 학생모델의 인식 정확도가 더 향상된다는 것을 알 수 있었다.

source: Then the association of the modalities is learned by means of DNN to produce a personal video event detector.
ko: 인공지능 기술이 미래의 핵심기술로 떠오름에 따라 세계 주요국과 글로벌 지식재산 선도 기업들의 집중적인 투자와 연구개발이 이루어지고 있다.

source: In our proposed method, audio and image data are first synchronized and then extracted.
ko: 인공지능 기술은 공공, 산업, 생활 등 국가 전반에 직 · 간접적인 효과를 창출할 것으로 전망됨에 따라 향후 국가 및 기업의 글로벌 경쟁력 확보 및 특허 전략에서 중요한 부분을 차지 할 것으로 전망된다.

source: Then, the result is input into GoogLeNet as well as Multi-Layer Perceptron (MLP) to extract high-level features.
ko: 본 논문에서는 인공지능 기술 분야의 특허동향을 통하여 국제적인 경쟁력을 갖추기 위한 산학연의 연구방향에 대해 살펴본다.

source: The results are then re-arranged in time sequence, and every video is processed to extract one feature each for training by means of DNN.
ko: 전자 부품의 결함 검사에서 미세한 크랙이나, 표면이 균일하지 않은 경우, 그리고 결함과 주변의 구분이 명확치 않은 조건에서는 검출자 기반의 접근이 성능의 한계를 보이고 있다.

source: The machine learning is receiving attention as a new method for energy big data analysis and power demand prediction to be more effectively operating a power system.
ko: 딥러닝 기법이 물체 인식에 널리 적용되고 있으며.

source: In this paper, we study input pattern of deep learning for power demand prediction using machine learning package of R and tensorflow.
ko: 결함 검출에 대해서도 점차 적용이 시도되고 있다.

source: The input pattern and learning rate in deep learning is the most important factor in power demand prediction.
ko: 일반적으로 딥러닝은 방대한 규모의 학습 데이터를 필요로 하나, 일부 산업응용 문제에서는 데이터의 획득이 제한적일 수 있다.
